load-tests/k6/reports/20260413-191038/smoke-auth-stdout.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: C:\Users\omano\OneDrive - Puravankara Limited\Manoranjan\Antigravity Experiment\000 Project PM\SETU\load-tests\k6\scenarios\smoke-auth.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 45s max duration (incl. graceful stop):
              * default: 1 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  01.0s/15s

running (02.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  02.0s/15s

running (03.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  03.0s/15s

running (04.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  04.0s/15s

running (05.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  05.0s/15s

running (06.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  06.0s/15s

running (07.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  07.0s/15s

running (08.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  08.0s/15s

running (09.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  09.0s/15s

running (10.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  10.0s/15s

running (11.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  11.0s/15s

running (12.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  12.0s/15s

running (13.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  13.0s/15s

running (14.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  14.0s/15s

running (15.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  15s

     ✗ login status is 2xx
      ↳  0% — ✓ 0 / ✗ 29

     checks.....................: 0.00%   ✓ 0        ✗ 29 
     data_received..............: 9.3 kB  602 B/s
     data_sent..................: 5.4 kB  350 B/s
     http_req_blocked...........: avg=2.28ms   min=0s       med=0s       max=66.13ms  p(90)=0s       p(95)=0s      
     http_req_connecting........: avg=76.37µs  min=0s       med=0s       max=2.21ms   p(90)=0s       p(95)=0s      
   ✓ http_req_duration..........: avg=526.68ms min=348.48ms med=500.55ms max=772.99ms p(90)=645.83ms p(95)=668.4ms 
   ✗ http_req_failed............: 100.00% ✓ 29       ✗ 0  
     http_req_receiving.........: avg=320.25µs min=0s       med=0s       max=1.34ms   p(90)=1ms      p(95)=1.17ms  
     http_req_sending...........: avg=88.79µs  min=0s       med=0s       max=573.9µs  p(90)=514.41µs p(95)=545.02µs
     http_req_tls_handshaking...: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...........: avg=526.27ms min=347.81ms med=500.03ms max=771.15ms p(90)=645.32ms p(95)=668.3ms 
     http_reqs..................: 29      1.879741/s
     iteration_duration.........: avg=529.88ms min=348.48ms med=501.64ms max=844.3ms  p(90)=647.01ms p(95)=668.93ms
     iterations.................: 29      1.879741/s
     vus........................: 1       min=1      max=1
     vus_max....................: 1       min=1      max=1


running (15.4s), 0/1 VUs, 29 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  15s
time="2026-04-13T19:10:47+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:48+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:48+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:49+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:49+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:50+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:50+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:51+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:51+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:52+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:52+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:53+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:53+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:54+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:54+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:55+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:55+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:56+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:57+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:57+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:57+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:58+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:59+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:10:59+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:11:00+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:11:00+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:11:01+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:11:01+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:11:02+05:30" level=error msg="Error: Login succeeded but no token found for user admin\n\tat login (file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/lib/auth.js:31:10(77))\n\tat file:///C:/Users/omano/OneDrive%20-%20Puravankara%20Limited/Manoranjan/Antigravity%20Experiment/000%20Project%20PM/SETU/load-tests/k6/scenarios/smoke-auth.js:17:24(10)\n" executor=constant-vus scenario=default source=stacktrace
time="2026-04-13T19:11:04+05:30" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"